#pragma once

#include "SkillDelay.h"
#include "ComboAttack.h"
#include "giocp.h"
#include "..\ggsvr\ggsvr.h"
#include "MagicInf.h"
#include "..\common\zzzitem.h"
#include "..\common\classdef.h"
#include "GuildClass.h"
#include "TDurMagicKeyChecker.h"
#include "TMonsterAIAgro.h"
#include "TMonsterSkillElementInfo.h"
#include "JewelOfHarmonySystem.h"
#include "ItemSystemFor380.h"
#include "SocketItemOption.h"
#include "protocol.h"
#include "PCBangUserSystem.h"
#if (ENABLETEST_MUUN == 1)
#include "MuunSystem.h"
#endif


#if (GS_SPEC == 0)
#if (GS_CASTLE == 1)

#define OBJMAX 4000
#define OBJMAXUSER 1500
#define OBJ_MAXMONSTER 1500

#else

#define OBJMAX 7400
#define OBJMAXUSER 1000
#define OBJ_MAXMONSTER 5800

#endif
#else

//-> 15~20
//#define OBJMAX 9000
//#define OBJMAXUSER 1000
//#define OBJ_MAXMONSTER 8000

//-> 15~25
//#define OBJMAX 10000
//#define OBJMAXUSER 1000
//#define OBJ_MAXMONSTER 9000

//-> 15~29
//#define OBJMAX			11000
//#define OBJMAXUSER		1000
//#define OBJ_MAXMONSTER	10000

//-> 17~30
#define OBJMAX			11500
#define OBJMAXUSER		1000
#define OBJ_MAXMONSTER	10500

/*
#define OBJMAX			12400
#define OBJMAXUSER		1000
#define OBJ_MAXMONSTER	10400*/
#endif

#define OBJ_STARTUSERINDEX (OBJMAX - OBJMAXUSER)
#define OBJ_CALLMONCOUNT (OBJ_STARTUSERINDEX - OBJ_MAXMONSTER)
#define MAX_MONSTER_SEND_MSG	20
#define MAX_MONSTER_SEND_ATTACK_MSG	50
#define MAX_MONSTER_TYPE 1024 //changed by season 7.2
#define MAX_GUILD_LEN 8
#define MAX_ACCOUNT_LEN 10

#define OBJMAX_RANGE(aIndex) ( ((aIndex) < 0 )?FALSE:( (aIndex) > OBJMAX-1 )?FALSE:TRUE   )
#define FRIEND_SERVER_STATE_LOGIN_FAIL	0
#define FRIEND_SERVER_STATE_OFFLINE		1
#define FRIEND_SERVER_STATE_ONLINE		2

#define MAIN_INVENTORY_RANGE(x) (((x)<0)?FALSE:((x)>MAIN_INVENTORY_SIZE-1)?FALSE:TRUE )
#define INVENTORY_RANGE(x) (((x)<0)?FALSE:((x)>INVENTORY_SIZE-1)?FALSE:TRUE )
#define WAREHOUSE_RANGE(x) (((x)<0)?FALSE:((x)>WAREHOUSE_SIZE-1)?FALSE:TRUE )
#define TRADE_BOX_RANGE(x) (((x)<0)?FALSE:((x)>TRADE_BOX_SIZE-1)?FALSE:TRUE )
#define OBJMON_RANGE(x) ( ((x)<0)?FALSE:((x)>OBJ_MAXMONSTER-1)?FALSE:TRUE)
#define PSHOP_RANGE(x) ( (((x)-MAIN_INVENTORY_SIZE)<0)?FALSE:(((x)-MAIN_INVENTORY_SIZE)>(INVENTORY_SIZE-MAIN_INVENTORY_SIZE-1))?FALSE:TRUE )
#define ATTRIBUTE_RANGE(x) (((x)<51)?FALSE:((x)>58)?FALSE:TRUE )

#define CURRENT_DB_VERSION	3

#define CHAR_SET_SIZE		18

	#define CS_CLASS		0

	#define CS_WEAPON1_TYPE	1
	#define CS_WEAPON2_TYPE	2

	#define CS_WEAPON1_DATA	12
	#define CS_WEAPON2_DATA	13

	#define CS_HELMET1		13
	#define CS_HELMET2		9
	#define CS_HELMET3		3

	#define CS_ARMOR1		14
	#define CS_ARMOR2		9
	#define CS_ARMOR3		3

	#define CS_PANTS1		14
	#define CS_PANTS2		9
	#define CS_PANTS3		4

	#define CS_GLOVES1		15
	#define CS_GLOVES2		9
	#define CS_GLOVES3		4

	#define CS_BOOTS1		15
	#define CS_BOOTS2		9
	#define CS_BOOTS3		5



#define CHECK_LIMIT(value, limit) ( ((value)<0)?FALSE:((value)>((limit)-1))?FALSE:TRUE  )
#define CHECK_CLASS(value, type) ( ((value)!=(type))?FALSE:TRUE )


#define CS_GET_CLASS(x) ( (((x)>>4)<<5)&(0xE0) )
#define CS_GET_CHANGEUP(x) ( ((x) & 0x07) )
#define CS_SET_CLASS(x) ( ((x)<<5)& 0xE0 )
#define CS_SET_CHANGEUP(x) ( ((x) << 4) & 0x10 )

#define CS_SET_HELMET1(x) ( ((x) & 0x1E0) >> 5 )
#define CS_SET_HELMET2(x) ( ((x) & 0x10 ) << 3 )
#define CS_SET_HELMET3(x) ( ((x) & 0x0F ) << 4 )

#define CS_SET_ARMOR1(x) ( ((x) & 0x1E0) >> 1 )
#define CS_SET_ARMOR2(x) ( ((x) & 0x10 ) << 2 )
#define CS_SET_ARMOR3(x) ( ((x) & 0x0F )      )

#define CS_SET_PANTS1(x) ( ((x) & 0x1E0) >> 5 )
#define CS_SET_PANTS2(x) ( ((x) & 0x10 ) << 1 )
#define CS_SET_PANTS3(x) ( ((x) & 0x0F ) << 4 )

#define CS_SET_GLOVES1(x) ( ((x) & 0x1E0) >> 1 )
#define CS_SET_GLOVES2(x) ( ((x) & 0x10 )      )
#define CS_SET_GLOVES3(x) ( ((x) & 0x0F )      )

#define CS_SET_BOOTS1(x) ( ((x) & 0x1E0) >> 5 )
#define CS_SET_BOOTS2(x) ( ((x) & 0x10 ) >> 1 )
#define CS_SET_BOOTS3(x) ( ((x) & 0x0F ) << 4 )

#define CS_SET_WING(x)  ( ((x) & 0x03 ) << 2 )
#define CS_SET_HELPER(x) ( ((x) & 0x03 )      )

#define CS_SET_SMALLLEVEL_RH(x)		( (x)       )
#define CS_SET_SMALLLEVEL_LH(x)		( (x) << 3  ) 
#define CS_SET_SMALLLEVEL_HELMET(x)	( (x) << 6  )
#define CS_SET_SMALLLEVEL_ARMOR(x)	( (x) << 9  )
#define CS_SET_SMALLLEVEL_PANTS(x)	( (x) << 12 )
#define CS_SET_SMALLLEVEL_GLOVES(x)	( (x) << 15 )
#define CS_SET_SMALLLEVEL_BOOTS(x)	( (x) << 18 )

#define CS_SET_SMALLLEVEL1(x)		( ((x) >> 16) & 0xFF )
#define CS_SET_SMALLLEVEL2(x)		( ((x) >> 8 ) & 0xFF )
#define CS_SET_SMALLLEVEL3(x)		((x) & 0xFF )





#include "ViewPortGuild.h"





typedef union tagPATHTABLE
{
	short sPathTable[16];
	char cPathTable[32];
} PATHTABLE, * LPPATHTABLE;



typedef struct tagActionState
{
	unsigned long Rest:1;	// 0
	unsigned long Attack:1;	// 1
	unsigned long Move:1;	// 2
	unsigned long Escape:1;	// 3
	unsigned long Emotion:4;	// 4
	unsigned long EmotionCount:8;	// 8

} ACTION_STATE, * LPACTION_STATE;



typedef struct tagInterfaceState
{
	DWORD use	: 2;
	DWORD state : 4;
	DWORD type	: 10;

} INTERFACE_STATE, * LPINTERFACE_STATE;

extern short RoadPathTable[MAX_ROAD_PATH_TABLE];
extern int  gServerMaxUser;	
extern BOOL g_EnergyCheckOff;

struct HITDAMAGE_STRUCT
{
	short number;	// 0
	int HitDamage;	// 4
	DWORD LastHitTime;	// 8
};

struct VIEWPORT_STRUCT
{
	char state;	// 0
	short number;	// 2
	unsigned char type;	// 4
	short index;	// 6
	int dis;	// 8
};

struct VIEWPORT_PLAYER_STRUCT
{
	char state;	// 0
	short number;	// 2
	unsigned char type;	// 4
	short index;	// 6
	int dis;	// 8

};


struct MessageStateMachine
{
	int MsgCode;	// 0
	int SendUser;	// 4
	DWORD MsgTime;	// 8
	int SubCode;	// C

};


struct ExMessageStateMachine
{
	int MsgCode;	// 0
	int SendUser;	// 4
	DWORD MsgTime;	// 8
	int SubCode;	// C
	int SubCode2;	// 10
};



typedef struct tagSEND_MONSTER_ATTACK_MENSSAGE
{
	int iMsgCode;	// unk0
	int iIndex;	// unk4
	DWORD dwDelay;	// unk8
	int iSubCode;	// unkC
	int iSubCode2;	// unk10
}SEND_MONSTER_ATTACK_MENSSAGE;

extern ExMessageStateMachine gSMAttackProcMsg[OBJMAX][MAX_MONSTER_SEND_ATTACK_MSG];
extern MessageStateMachine gSMMsg[OBJMAX][MAX_MONSTER_SEND_MSG];

#define MAX_EFFECT 100

struct EFFECT_INFO
{
	BYTE btEffectNum;
	BYTE btOptionType;
	BYTE btEffectType1;
	BYTE btEffectType2;
	BYTE btEffectType3;
	int iEffectValue1;
	int iEffectValue2;
	int iEffectValue3;
	DWORD dwTICK_COUNT;
	int iTimeValue;
};

struct QUEST_MONSTER_KILL_INFO
{
	int m_MonsterIndex;
	int m_KillCount;
};


#if ( __QUEST_SYSTEM__ == 1 )

#define MAX_QUESTEX_GROUP		20

#pragma pack(push)
#pragma pack(1)
struct QUESTEX_USER
{
	BYTE	btStartQuest;
	BYTE	btCurQuest;
	BYTE	btState;
	WORD	wQuestInfo[5];
};
#pragma pack(pop)

struct USER_QUESTEX_INFO
{
	BYTE btInit;
	QUESTEX_USER	Quest[MAX_QUESTEX_GROUP];
};

#endif

typedef struct _MASTERLEVEL_PASSIVE_SKILL_OPTION 
{
	float MpsAttackSuccessRate; // 00
	float MpsBlockingRate;		// 04
	float MpsPVPAttackDmgRate;	// 08
	float MpsPVPBlockingRate;	// 0C
	float MpsDownDur1;			// 10
	BYTE btMpsDownDur1Level;	// 14
	float MpsDownDur2;			// 18
	float MpsDownDur3;			// 1C
	float MpsResistancePoison;	// 20
	float MpsResistanceThunder;	// 24
	float MpsResistanceIce;		// 28
	float MpsAutoRecoverLife;	// 2C
	float MpsAutoRecoverMana;	// 30
	float MpsAutoRecoverAG;		// 34
	float MpsWeaponMastery;		// 38 dk, mg, dl
	float ukn_3C;				// 3C
	float MpsTwoHandSwordStrength; // 40
	float MpsOneHandSwordStrength; // 44
	float MpsMaceStrength;		// 48
	float MpsSpearStrength;		// 4C
	float MpsTwoHandSwordMastery;// 50
	float MpsOneHandSwordMastery;// 54
	float MpsIgnoreDef;				// 58
	float MpsSpearMastery;		// 5C
	float MpsMaceMastery;		// 60
	float MpsMaxMPMul;				// 64
	float MpsMagicMastery;		// 68 dw, mg
	float MpsTwoHandStaffStrength; // 6C
	float MpsOneHandStaffStrength; // 70
	float MpsShieldStrength;	// 74
	float MpsOneHandStaffMastery;// 78
	float MpsTwoHandStaffMastery;// 7C
	float MpsShieldMastery;		// 80
	float MpsBowStrength;		// 84
	float MpsBowMastery;		// 88
	float MpsCrossbowStrength;	// 8C
	float MpsCrossbowMastery;	// 90
	float MpsShieldStrength2;	// 94
	float MpsShieldMastery2;				// 98
	float MpsWeaponMastery2;	// 9C Elf Weapon Mastery
	float MpsSummonMonster1;	// A0
	float MpsSummonMonster2;	// A4
	float MpsSummonMonster3;	// A8
	float MpsMagicMastery2;		// AC summoner 
	float MpsFireTomeStrength;	// B0
	float MpsWindTomeStrength;	// B4
	float MpsLightTomeStrength;	// B8
	float MpsFireTomeMastery;	// BC
	float MpsWindTomeMastery;	// C0
	float MpsLightTomeMastery;	// C4
	float MpsStickStrength;		// C8
	float MpsTomeStrength;		// CC
	float MpsStickMastery;		// D0
	float MpsTomeMastery;		// D4
	float MpsBerserkInc1;		// D8
	float MpsBerserkInc2;		// DC
	float MpsBerserkInc3;		// E0
	float MpsMinWizCurseInc;	// E4
	float MpsDarkHorseStrength;	// E8
	float ukn_EC;				// EC
	float MpsDarkSpiritStr1;	// F0
	float MpsDarkSpiritStr2;	// F4
	float MpsDarkSpiritStr3;	// F8
	float MpsScepterStrength;	// FC
	float MpsScepterMastery;	// 100
	float MpsShieldStrength3;	// 104 dl
	float MpsShieldMastery3;	// 108 dl
	float MpsUseScepterPetStr;	// 10C dl
	float MpsCommandAttackInc;	// 110
	float MpsMinAttackInc;		// 114
	float MpsMaxAttackInc;		// 118
	float MpsExpWizardryCrit;	// 11C
	float MpsAddZen;			// 120
	float MpsDefence;			// 124
	float MpsMaxHP;				// 128
	float MpsMaxBP;				// 12C
	float MpsMaxMP;				// 130
	float MpsMonsterDieGetMana;	// 134
	float MpsMonsterDieGetLife;	// 138
	float MpsMonsterDieGetSD;	// 13C
	float MpsAddMLExp;				// 140
	float MpsMaxSD;				// 144
	float MpsSDSpeed;			// 148 auto rec
	float MpsMaxAttackDamage;	// 14C
	float MpsMinAttackDamage;	// 150
	float MpsDecreaseMana;		// 154
	float MpsMaxMagicDamage;	// 158
	float MpsMinMagicDamage;	// 15C
	float MpsPetDurDownSpeed;	// 160
	float MpsMgMaxMagicDamage;	// 164
	float MpsMgMinMagicDamage;	// 168
	float MpsFistStrength;		// 16C
	float MpsFistMastery;		// 170
	float MpsArmorSetBonusIncrease;	// 174
	float MpsReflectDamage;			// 178
	float MpsEnergyIncrease;		// 17C
	float MpsVitalityIncrease;		// 180
	float MpsDexterityIncrease;		// 184
	float MpsStrengthIncrease;		// 188
	float MpsLeadershipIncrease;	// 18C
	float MpsWingDefenseIncrease;	// 190
	float MpsWingAttackIncrease;	// 194
	float MpsComboAttackIncrease;	// 198
	float MpsCriticalRateIncrease;	// 19C
	float MpsExcelentRateIncrease;	// 1A0
	float MpsRestoreFullHP;			// 1A4
	float MpsRestoreFullMP;			// 1A8
	float MpsRestoreFullSD;			// 1AC
	float MpsDoubleDamageRate;		// 1B0
	float MpsSwellLifeAddBP;		// 1B4
	float MpsManaShieldAddMana;		// 1B8
	float MpsCritBuffExcDamage;		// 1BC
	float MpsDarkSpiritStr4;		// 1C0
	float MpsDarkSpiritStr5;		// 1C4
	float MpsDarkSpiritStr6;		// 1C8

}MASTERLEVEL_PASSIVE_SKILL_OPTION;
// <size 0x16C>

struct ERTEL_USER
{
	void Clear()
	{
		btType = -1;
		btAttribute = -1;

		for(int i = 0; i < 5; i++)	{
			Option[i] = 0x0F;
			Level[1] = 0x0F;
		}
	};

	BYTE btType;
	BYTE btAttribute;
	BYTE Option[5];
	BYTE Level[5];
};

struct ELEMENTAL_OPTIONS
{
	int m_AddFirePercDmg;
	int m_AddWaterPercDmg;
	int m_AddEarthPercDmg;
	int m_AddWindPercDmg;
	int m_AddDarkPercDmg;
	int m_AddDmgPVP;
	int m_AddDmgPVE;
	int m_AddRangedPVP;
	int m_AddMaleePVP;
	int m_AddCritRatePVP;
	int m_AddCritRatePVE;
	int m_AddFirePercDef;
	int m_AddWaterPercDef;
	int m_AddEarthPercDef;
	int m_AddWindPercDef;
	int m_AddDarkPercDef;
	int m_AddDefPVP;
	int m_AddDefPVE;
	int m_AddRangedDefPVP;
	int m_AddMaleeDefPVP;
	int m_DecreasePVP;
	int m_DecreasePVE;
	int m_AddAttackRate;
	int m_AddDefenseRate;
	int m_IncreasePVP;
	int m_IncreasePVE;
	int m_DebuffRate;
	int m_ExcRatePVP;
	int m_ExcRatePVE;
	int m_ElementalRate;
